main/subscribe.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV='http://www.w3.org/2003/05/soap-envelope'
    xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
    xmlns:s='http://www.w3.org/2001/XMLSchema'
    xmlns:wsa='http://www.w3.org/2005/08/addressing'>
    <SOAP-ENV:Header>
        <wsa:Action SOAP-ENV:mustUnderstand='true'>http://docs.oasis-open.org/wsn/bw-2/NotificationProducer/SubscribeRequest</wsa:Action>
        <wsa:MessageID>urn:uuid:d7c92001-f1f2-43f9-9d1e-8d9390d6da5a</wsa:MessageID>
        <wsa:ReplyTo SOAP-ENV:mustUnderstand='true'>
            <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
        </wsa:ReplyTo>
        <wsa:To>http://spirit-test-01.tianispirit.co.uk:8081/SpiritXDSDsub/Dsub</wsa:To>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <wsnt:Subscribe xmlns:wsnt='http://docs.oasis-open.org/wsn/b-2'
            xmlns:a='http://www.w3.org/2005/08/addressing'
            xmlns:rim='urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0'
            xmlns:wsa='http://www.w3.org/2005/08/addressing'>
            <wsnt:ConsumerReference>
                <wsa:Address>tukeventserver.ddns.net</wsa:Address>
            </wsnt:ConsumerReference>
            <wsnt:Filter>
                <wsnt:TopicExpression Dialect='http://docs.oasis-open.org/wsn/t-1/TopicExpression/Simple'>ihe:FullDocumentEntry</wsnt:TopicExpression>
                <rim:AdhocQuery id='urn:uuid:742790e0-aba6-43d6-9f1f-e43ed9790b79'>
                    <rim:Slot name='$XDSDocumentEntryTypeCode'>
                        <rim:ValueList>
                            <rim:Value>('LAC1^^TypeCode_EPUT_2018')</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                </rim:AdhocQuery>
            </wsnt:Filter>
        </wsnt:Subscribe>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
